/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BaseOptions {
    pub model_asset_buffer: *const ::std::os::raw::c_char,
    pub model_asset_buffer_count: ::std::os::raw::c_uint,
    pub model_asset_path: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BaseOptions"][::std::mem::size_of::<BaseOptions>() - 24usize];
    ["Alignment of BaseOptions"][::std::mem::align_of::<BaseOptions>() - 8usize];
    ["Offset of field: BaseOptions::model_asset_buffer"]
        [::std::mem::offset_of!(BaseOptions, model_asset_buffer) - 0usize];
    ["Offset of field: BaseOptions::model_asset_buffer_count"]
        [::std::mem::offset_of!(BaseOptions, model_asset_buffer_count) - 8usize];
    ["Offset of field: BaseOptions::model_asset_path"]
        [::std::mem::offset_of!(BaseOptions, model_asset_path) - 16usize];
};
pub const MpStatus_kMpOk: MpStatus = 0;
pub const MpStatus_kMpCancelled: MpStatus = 1;
pub const MpStatus_kMpUnknown: MpStatus = 2;
pub const MpStatus_kMpInvalidArgument: MpStatus = 3;
pub const MpStatus_kMpDeadlineExceeded: MpStatus = 4;
pub const MpStatus_kMpNotFound: MpStatus = 5;
pub const MpStatus_kMpAlreadyExists: MpStatus = 6;
pub const MpStatus_kMpPermissionDenied: MpStatus = 7;
pub const MpStatus_kMpResourceExhausted: MpStatus = 8;
pub const MpStatus_kMpFailedPrecondition: MpStatus = 9;
pub const MpStatus_kMpAborted: MpStatus = 10;
pub const MpStatus_kMpOutOfRange: MpStatus = 11;
pub const MpStatus_kMpUnimplemented: MpStatus = 12;
pub const MpStatus_kMpInternal: MpStatus = 13;
pub const MpStatus_kMpUnavailable: MpStatus = 14;
pub const MpStatus_kMpDataLoss: MpStatus = 15;
pub const MpStatus_kMpUnauthenticated: MpStatus = 16;
pub type MpStatus = ::std::os::raw::c_uint;
pub const RunningMode_IMAGE: RunningMode = 1;
pub const RunningMode_VIDEO: RunningMode = 2;
pub const RunningMode_LIVE_STREAM: RunningMode = 3;
pub type RunningMode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MpStringList {
    pub strings: *mut *mut ::std::os::raw::c_char,
    pub num_strings: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MpStringList"][::std::mem::size_of::<MpStringList>() - 16usize];
    ["Alignment of MpStringList"][::std::mem::align_of::<MpStringList>() - 8usize];
    ["Offset of field: MpStringList::strings"]
        [::std::mem::offset_of!(MpStringList, strings) - 0usize];
    ["Offset of field: MpStringList::num_strings"]
        [::std::mem::offset_of!(MpStringList, num_strings) - 8usize];
};
unsafe extern "C" {
    pub fn MpStringListFree(string_list: *mut MpStringList);
}
pub const MpImageFormat_kMpImageFormatUnknown: MpImageFormat = 0;
pub const MpImageFormat_kMpImageFormatSrgb: MpImageFormat = 1;
pub const MpImageFormat_kMpImageFormatSrgba: MpImageFormat = 2;
pub const MpImageFormat_kMpImageFormatGray8: MpImageFormat = 3;
pub const MpImageFormat_kMpImageFormatGray16: MpImageFormat = 4;
pub const MpImageFormat_kMpImageFormatSrgb48: MpImageFormat = 7;
pub const MpImageFormat_kMpImageFormatSrgba64: MpImageFormat = 8;
pub const MpImageFormat_kMpImageFormatVec32F1: MpImageFormat = 9;
pub const MpImageFormat_kMpImageFormatVec32F2: MpImageFormat = 12;
pub const MpImageFormat_kMpImageFormatVec32F4: MpImageFormat = 13;
pub type MpImageFormat = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MpImageInternal {
    _unused: [u8; 0],
}
pub type MpImagePtr = *mut MpImageInternal;
unsafe extern "C" {
    pub fn MpImageCreateFromUint8Data(
        format: MpImageFormat,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        pixel_data: *const u8,
        pixel_data_size: ::std::os::raw::c_int,
        out: *mut MpImagePtr,
    ) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageCreateFromUint16Data(
        format: MpImageFormat,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        pixel_data: *const u16,
        pixel_data_size: ::std::os::raw::c_int,
        out: *mut MpImagePtr,
    ) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageCreateFromFloatData(
        format: MpImageFormat,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        pixel_data: *const f32,
        pixel_data_size: ::std::os::raw::c_int,
        out: *mut MpImagePtr,
    ) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageCreateFromImageFrame(image: MpImagePtr, out: *mut MpImagePtr) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageCreateFromFile(
        file_name: *const ::std::os::raw::c_char,
        out: *mut MpImagePtr,
    ) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageIsContiguous(image: MpImagePtr) -> bool;
}
unsafe extern "C" {
    pub fn MpImageUsesGpu(image: MpImagePtr) -> bool;
}
unsafe extern "C" {
    pub fn MpImageIsEmpty(image: MpImagePtr) -> bool;
}
unsafe extern "C" {
    pub fn MpImageIsAligned(image: MpImagePtr, alignment_boundary: u32) -> bool;
}
unsafe extern "C" {
    pub fn MpImageGetWidth(image: MpImagePtr) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn MpImageGetHeight(image: MpImagePtr) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn MpImageGetChannels(image: MpImagePtr) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn MpImageGetByteDepth(image: MpImagePtr) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn MpImageGetWidthStep(image: MpImagePtr) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn MpImageGetFormat(image: MpImagePtr) -> MpImageFormat;
}
unsafe extern "C" {
    pub fn MpImageDataUint8(image: MpImagePtr, out: *mut *const u8) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageDataUint16(image: MpImagePtr, out: *mut *const u16) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageDataFloat32(image: MpImagePtr, out: *mut *const f32) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageGetValueUint8(
        image: MpImagePtr,
        pos: *mut ::std::os::raw::c_int,
        pos_size: ::std::os::raw::c_int,
        out: *mut u8,
    ) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageGetValueUint16(
        image: MpImagePtr,
        pos: *mut ::std::os::raw::c_int,
        pos_size: ::std::os::raw::c_int,
        out: *mut u16,
    ) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageGetValueFloat32(
        image: MpImagePtr,
        pos: *mut ::std::os::raw::c_int,
        pos_size: ::std::os::raw::c_int,
        out: *mut f32,
    ) -> MpStatus;
}
unsafe extern "C" {
    pub fn MpImageFree(image: MpImagePtr);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPRectF {
    pub left: f32,
    pub top: f32,
    pub bottom: f32,
    pub right: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MPRectF"][::std::mem::size_of::<MPRectF>() - 16usize];
    ["Alignment of MPRectF"][::std::mem::align_of::<MPRectF>() - 4usize];
    ["Offset of field: MPRectF::left"][::std::mem::offset_of!(MPRectF, left) - 0usize];
    ["Offset of field: MPRectF::top"][::std::mem::offset_of!(MPRectF, top) - 4usize];
    ["Offset of field: MPRectF::bottom"][::std::mem::offset_of!(MPRectF, bottom) - 8usize];
    ["Offset of field: MPRectF::right"][::std::mem::offset_of!(MPRectF, right) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImageProcessingOptions {
    pub has_region_of_interest: ::std::os::raw::c_int,
    pub region_of_interest: MPRectF,
    pub rotation_degrees: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ImageProcessingOptions"][::std::mem::size_of::<ImageProcessingOptions>() - 24usize];
    ["Alignment of ImageProcessingOptions"]
        [::std::mem::align_of::<ImageProcessingOptions>() - 4usize];
    ["Offset of field: ImageProcessingOptions::has_region_of_interest"]
        [::std::mem::offset_of!(ImageProcessingOptions, has_region_of_interest) - 0usize];
    ["Offset of field: ImageProcessingOptions::region_of_interest"]
        [::std::mem::offset_of!(ImageProcessingOptions, region_of_interest) - 4usize];
    ["Offset of field: ImageProcessingOptions::rotation_degrees"]
        [::std::mem::offset_of!(ImageProcessingOptions, rotation_degrees) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Landmark {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub has_visibility: bool,
    pub visibility: f32,
    pub has_presence: bool,
    pub presence: f32,
    pub name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Landmark"][::std::mem::size_of::<Landmark>() - 40usize];
    ["Alignment of Landmark"][::std::mem::align_of::<Landmark>() - 8usize];
    ["Offset of field: Landmark::x"][::std::mem::offset_of!(Landmark, x) - 0usize];
    ["Offset of field: Landmark::y"][::std::mem::offset_of!(Landmark, y) - 4usize];
    ["Offset of field: Landmark::z"][::std::mem::offset_of!(Landmark, z) - 8usize];
    ["Offset of field: Landmark::has_visibility"]
        [::std::mem::offset_of!(Landmark, has_visibility) - 12usize];
    ["Offset of field: Landmark::visibility"]
        [::std::mem::offset_of!(Landmark, visibility) - 16usize];
    ["Offset of field: Landmark::has_presence"]
        [::std::mem::offset_of!(Landmark, has_presence) - 20usize];
    ["Offset of field: Landmark::presence"][::std::mem::offset_of!(Landmark, presence) - 24usize];
    ["Offset of field: Landmark::name"][::std::mem::offset_of!(Landmark, name) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NormalizedLandmark {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub has_visibility: bool,
    pub visibility: f32,
    pub has_presence: bool,
    pub presence: f32,
    pub name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NormalizedLandmark"][::std::mem::size_of::<NormalizedLandmark>() - 40usize];
    ["Alignment of NormalizedLandmark"][::std::mem::align_of::<NormalizedLandmark>() - 8usize];
    ["Offset of field: NormalizedLandmark::x"]
        [::std::mem::offset_of!(NormalizedLandmark, x) - 0usize];
    ["Offset of field: NormalizedLandmark::y"]
        [::std::mem::offset_of!(NormalizedLandmark, y) - 4usize];
    ["Offset of field: NormalizedLandmark::z"]
        [::std::mem::offset_of!(NormalizedLandmark, z) - 8usize];
    ["Offset of field: NormalizedLandmark::has_visibility"]
        [::std::mem::offset_of!(NormalizedLandmark, has_visibility) - 12usize];
    ["Offset of field: NormalizedLandmark::visibility"]
        [::std::mem::offset_of!(NormalizedLandmark, visibility) - 16usize];
    ["Offset of field: NormalizedLandmark::has_presence"]
        [::std::mem::offset_of!(NormalizedLandmark, has_presence) - 20usize];
    ["Offset of field: NormalizedLandmark::presence"]
        [::std::mem::offset_of!(NormalizedLandmark, presence) - 24usize];
    ["Offset of field: NormalizedLandmark::name"]
        [::std::mem::offset_of!(NormalizedLandmark, name) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Landmarks {
    pub landmarks: *mut Landmark,
    pub landmarks_count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Landmarks"][::std::mem::size_of::<Landmarks>() - 16usize];
    ["Alignment of Landmarks"][::std::mem::align_of::<Landmarks>() - 8usize];
    ["Offset of field: Landmarks::landmarks"]
        [::std::mem::offset_of!(Landmarks, landmarks) - 0usize];
    ["Offset of field: Landmarks::landmarks_count"]
        [::std::mem::offset_of!(Landmarks, landmarks_count) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NormalizedLandmarks {
    pub landmarks: *mut NormalizedLandmark,
    pub landmarks_count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NormalizedLandmarks"][::std::mem::size_of::<NormalizedLandmarks>() - 16usize];
    ["Alignment of NormalizedLandmarks"][::std::mem::align_of::<NormalizedLandmarks>() - 8usize];
    ["Offset of field: NormalizedLandmarks::landmarks"]
        [::std::mem::offset_of!(NormalizedLandmarks, landmarks) - 0usize];
    ["Offset of field: NormalizedLandmarks::landmarks_count"]
        [::std::mem::offset_of!(NormalizedLandmarks, landmarks_count) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PoseLandmarkerResult {
    pub segmentation_masks: *mut MpImagePtr,
    pub segmentation_masks_count: u32,
    pub pose_landmarks: *mut NormalizedLandmarks,
    pub pose_landmarks_count: u32,
    pub pose_world_landmarks: *mut Landmarks,
    pub pose_world_landmarks_count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PoseLandmarkerResult"][::std::mem::size_of::<PoseLandmarkerResult>() - 48usize];
    ["Alignment of PoseLandmarkerResult"][::std::mem::align_of::<PoseLandmarkerResult>() - 8usize];
    ["Offset of field: PoseLandmarkerResult::segmentation_masks"]
        [::std::mem::offset_of!(PoseLandmarkerResult, segmentation_masks) - 0usize];
    ["Offset of field: PoseLandmarkerResult::segmentation_masks_count"]
        [::std::mem::offset_of!(PoseLandmarkerResult, segmentation_masks_count) - 8usize];
    ["Offset of field: PoseLandmarkerResult::pose_landmarks"]
        [::std::mem::offset_of!(PoseLandmarkerResult, pose_landmarks) - 16usize];
    ["Offset of field: PoseLandmarkerResult::pose_landmarks_count"]
        [::std::mem::offset_of!(PoseLandmarkerResult, pose_landmarks_count) - 24usize];
    ["Offset of field: PoseLandmarkerResult::pose_world_landmarks"]
        [::std::mem::offset_of!(PoseLandmarkerResult, pose_world_landmarks) - 32usize];
    ["Offset of field: PoseLandmarkerResult::pose_world_landmarks_count"]
        [::std::mem::offset_of!(PoseLandmarkerResult, pose_world_landmarks_count) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MpPoseLandmarkerInternal {
    _unused: [u8; 0],
}
pub type MpPoseLandmarkerPtr = *mut MpPoseLandmarkerInternal;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PoseLandmarkerOptions {
    pub base_options: BaseOptions,
    pub running_mode: RunningMode,
    pub num_poses: ::std::os::raw::c_int,
    pub min_pose_detection_confidence: f32,
    pub min_pose_presence_confidence: f32,
    pub min_tracking_confidence: f32,
    pub output_segmentation_masks: bool,
    pub result_callback: PoseLandmarkerOptions_result_callback_fn,
}
pub type PoseLandmarkerOptions_result_callback_fn = ::std::option::Option<
    unsafe extern "C" fn(
        status: MpStatus,
        result: *const PoseLandmarkerResult,
        image: MpImagePtr,
        timestamp_ms: i64,
    ),
>;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PoseLandmarkerOptions"][::std::mem::size_of::<PoseLandmarkerOptions>() - 56usize];
    ["Alignment of PoseLandmarkerOptions"]
        [::std::mem::align_of::<PoseLandmarkerOptions>() - 8usize];
    ["Offset of field: PoseLandmarkerOptions::base_options"]
        [::std::mem::offset_of!(PoseLandmarkerOptions, base_options) - 0usize];
    ["Offset of field: PoseLandmarkerOptions::running_mode"]
        [::std::mem::offset_of!(PoseLandmarkerOptions, running_mode) - 24usize];
    ["Offset of field: PoseLandmarkerOptions::num_poses"]
        [::std::mem::offset_of!(PoseLandmarkerOptions, num_poses) - 28usize];
    ["Offset of field: PoseLandmarkerOptions::min_pose_detection_confidence"]
        [::std::mem::offset_of!(PoseLandmarkerOptions, min_pose_detection_confidence) - 32usize];
    ["Offset of field: PoseLandmarkerOptions::min_pose_presence_confidence"]
        [::std::mem::offset_of!(PoseLandmarkerOptions, min_pose_presence_confidence) - 36usize];
    ["Offset of field: PoseLandmarkerOptions::min_tracking_confidence"]
        [::std::mem::offset_of!(PoseLandmarkerOptions, min_tracking_confidence) - 40usize];
    ["Offset of field: PoseLandmarkerOptions::output_segmentation_masks"]
        [::std::mem::offset_of!(PoseLandmarkerOptions, output_segmentation_masks) - 44usize];
    ["Offset of field: PoseLandmarkerOptions::result_callback"]
        [::std::mem::offset_of!(PoseLandmarkerOptions, result_callback) - 48usize];
};
unsafe extern "C" {
    pub fn pose_landmarker_create(
        options: *mut PoseLandmarkerOptions,
        error_msg: *mut *mut ::std::os::raw::c_char,
    ) -> MpPoseLandmarkerPtr;
}
unsafe extern "C" {
    pub fn pose_landmarker_detect_image(
        landmarker: MpPoseLandmarkerPtr,
        image: MpImagePtr,
        options: *const ImageProcessingOptions,
        result: *mut PoseLandmarkerResult,
        error_msg: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pose_landmarker_detect_for_video(
        landmarker: MpPoseLandmarkerPtr,
        image: MpImagePtr,
        options: *const ImageProcessingOptions,
        timestamp_ms: i64,
        result: *mut PoseLandmarkerResult,
        error_msg: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pose_landmarker_detect_async(
        landmarker: MpPoseLandmarkerPtr,
        image: MpImagePtr,
        options: *const ImageProcessingOptions,
        timestamp_ms: i64,
        error_msg: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pose_landmarker_close_result(result: *mut PoseLandmarkerResult);
}
unsafe extern "C" {
    pub fn pose_landmarker_close(
        landmarker: MpPoseLandmarkerPtr,
        error_msg: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
